#include<iostream>

using namespace std;

int main()
{
	int a, b, c, d, S;
	
	cout << "Існує припущення, що тривалість свого життя можна визначити як середнє арифметичне тривалості життя своїх близьких родичів: батьків, дідусів, бабусь." <<
endl;

	cout << "Введіть скільки прожив родич a (в повних роках!):" << endl;
	cin >> a;
	
	cout << "Введіть скільки прожив родич b (в повних роках!):" << endl;
	cin >> b;
	
	cout << "Введіть скільки прожив родич c (в повних роках!):" << endl;
	cin >> c;
	
	cout << "Введіть скільки прожив родич d (в повних роках!):" << endl;
	cin >> d;
	
	S = (a+b+c+d)/4;
	
	cout << "Приблизна тривалість вашого життя:" << S << "років" << endl;
}